In [1]:
import pandas as pd
import numpy as np
import ast
import json

In [2]:
pd.set_option('display.max_colwidth', None)

In [19]:
dfproduction= pd.read_csv(r'C:\Users\flori\Desktop\DATA SCIENCE\LABS\Trabajos\Proyecto_Indiv_1_MLO_Henry\ETL\Production.csv')

dfproduction.rename(columns={'id':'id_original'}, inplace= True)

dfproduction.head()

,id_original,production_companies,production_countries
0,862,"[{'name': 'Pixar Animation Studios', 'id': 3}]","[{'iso_3166_1': 'US', 'name': 'United States of America'}]"
1,8844,"[{'name': 'TriStar Pictures', 'id': 559}, {'name': 'Teitler Film', 'id': 2550}, {'name': 'Interscope Communications', 'id': 10201}]","[{'iso_3166_1': 'US', 'name': 'United States of America'}]"
2,15602,"[{'name': 'Warner Bros.', 'id': 6194}, {'name': 'Lancaster Gate', 'id': 19464}]","[{'iso_3166_1': 'US', 'name': 'United States of America'}]"
3,31357,"[{'name': 'Twentieth Century Fox Film Corporation', 'id': 306}]","[{'iso_3166_1': 'US', 'name': 'United States of America'}]"
4,11862,"[{'name': 'Sandollar Productions', 'id': 5842}, {'name': 'Touchstone Pictures', 'id': 9195}]","[{'iso_3166_1': 'US', 'name': 'United States of America'}]"

In [20]:
dfproduction.shape

(45466, 3)

In [21]:
dfproduction.dropna(inplace=True)

In [22]:
dfproduction.shape

(45463, 3)

In [23]:
dfproduction['production_companies'] = dfproduction['production_companies'].apply(ast.literal_eval)

In [24]:
df_explodedprod = dfproduction.explode('production_companies')

def extract_companies_info(x):
    if isinstance(x, dict):
        return pd.Series([x.get('name', ''),x.get('id', '')])
    else:
        return pd.Series(['', ''])

df_explodedprod[['name', 'id']] = df_explodedprod['production_companies'].apply(extract_companies_info)

In [35]:
df_explodedprod.head()

  id_original                       name     id
0         862    Pixar Animation Studios      3
1        8844           TriStar Pictures    559
1        8844               Teitler Film   2550
1        8844  Interscope Communications  10201
2       15602               Warner Bros.   6194

In [26]:
columnas_eliminar= ['production_companies', 'production_countries']
df_explodedprod.drop(columns=columnas_eliminar, inplace=True)

In [27]:
df_explodedprod.shape

(82423, 3)

In [32]:
df_explodedprod.head()

  id_original                       name     id
0         862    Pixar Animation Studios      3
1        8844           TriStar Pictures    559
1        8844               Teitler Film   2550
1        8844  Interscope Communications  10201
2       15602               Warner Bros.   6194

In [33]:
df_explodedprod.to_csv('EstudiosIDpeli.csv', index=False)

In [31]:
#df_explodedprod[['id_original','name']].groupby('name').value_counts()

name     id_original
         159849         2
         12600          2
         25541          2
         99080          2
         84198          2
                       ..
영화사 집    382220         1
이디오플랜    435821         1
인벤트 디    267466         1
타임스토리그룹  133603         1
프로덕션M    26138          1
Length: 82333, dtype: int64